app/views/journal_entries/index.html.erb


    <% img_url = current_user.admin? ? current_user.image_url : @journal_entries.first.user.image_url %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]


        <% if journal_entry.categories.count > 0 %>

          <% journal_entry.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "journal_categories" ON "categories"."id" = "journal_categories"."category_id" WHERE "journal_categories"."journal_entry_id" = $1  [["journal_entry_id", 5]]
SELECT COUNT(*) FROM "categories" INNER JOIN "journal_categories" ON "categories"."id" = "journal_categories"."category_id" WHERE "journal_categories"."journal_entry_id" = $1  [["journal_entry_id", 10]]
SELECT "categories".* FROM "categories" INNER JOIN "journal_categories" ON "categories"."id" = "journal_categories"."category_id" WHERE "journal_categories"."journal_entry_id" = $1  [["journal_entry_id", 10]]