app/views/tasks/_task_card.html.erb


      <% if task.subtasks.length.positive? %>
---
SELECT "sub_tasks".* FROM "sub_tasks" WHERE "sub_tasks"."task_id" = $1  [["task_id", 11]]