app/views/tasks/index.html.erb

SELECT "tasks".* FROM "tasks"
SELECT "sub_tasks".* FROM "sub_tasks" WHERE "sub_tasks"."task_id" = $1  [["task_id", 2]]
---

        <% task.sub_tasks.each do |subtask| %>