app/views/tasks/index.html.erb

SELECT "sub_tasks".* FROM "sub_tasks" WHERE "sub_tasks"."task_id" = $1  [["task_id", 1]]
---

        <% task.sub_tasks.each do |subtask| %>