app/controllers/restaurants_controller.rb

  def create
    @restaurant = Restaurant.new(restaurant_params)
    @restaurant.user = current_user
    authorize @restaurant

    if @restaurant.save
---
INSERT INTO "restaurants" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Ambala"], ["user_id", 1], ["created_at", "2024-10-13 19:51:19.483937"], ["updated_at", "2024-10-13 19:51:19.483937"]]

  def destroy
    authorize @restaurant
    @restaurant.destroy
---
DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 1]]