app/controllers/sub_tasks_controller.rb

  def new
    @task = Task.find(params[:task_id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @task = Task.find(params[:task_id])
    @sub_task = SubTask.new(sub_task_params)
    @sub_task.task = @task
    authorize @sub_task

    if @sub_task.save
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "sub_tasks" ("task_id", "order", "title", "description", "comment", "start_date", "due_date", "completed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def destroy
    authorize @sub_task
    @sub_task.destroy
---
DELETE FROM "sub_tasks" WHERE "sub_tasks"."id" = $1  [["id", 11]]

  def set_sub_task
    @sub_task = SubTask.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "sub_tasks".* FROM "sub_tasks" WHERE "sub_tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]