app/controllers/tasks_controller.rb

  def index
    @test = "Hello World! Salve Mundi! This is a test: 1, 2, 3... !!!"
    if has_valid_routine?
      @tasks = policy_scope(Task).where(user: current_user, routine: params[:routine])
    else
      @tasks = policy_scope(Task).where(user: current_user, routine: Task::NONE_ROUTINE_NAME)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 1]]

  def create
    @task = Task.new(task_params)
    @task.user = current_user
    authorize @task
    respond_to do |format|
      if @task.save
        if (request.referer.include?("log"))
          path = request.referer
        else
          path = @task.routine? ? tasks_path(routine: @task.routine) : tasks_path
        end
        format.html { redirect_to path, notice: "Task, #{@task.title}, created successfully with #{@task.subtasks.count} sub tasks!", status: :see_other }
---
INSERT INTO "tasks" ("user_id", "routine", "recurs_on", "active", "task_type", "order", "title", "description", "comment", "start_date", "due_date", "completed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
SELECT COUNT(*) FROM "tasks"

  def update
    authorize @task
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "routine" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["routine", 1], ["updated_at", "2024-10-16 18:16:27.497215"], ["id", 2]]

  def destroy
    authorize @task
    title = @task.title
    @task.subtasks.destroy_all
---
DELETE FROM "sub_tasks" WHERE "sub_tasks"."id" = $1  [["id", 4]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 3]]

  def set_task
    @task = Task.find(params[:id])
---
SELECT "sub_tasks".* FROM "sub_tasks" WHERE "sub_tasks"."task_id" = $1  [["task_id", 3]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]