app/models/sub_task.rb

SELECT COUNT(*) FROM "sub_tasks" WHERE "sub_tasks"."task_id" = $1  [["task_id", 1]]
---
  def set_initial_order
    self.task.sub_tasks.count + 1