app/models/task.rb

    def set_initial_order
      self.order = Task.count + 1
---
SELECT COUNT(*) FROM "tasks"